"""
    演示张量的点乘和矩阵乘法操作
点乘:
    要求:两个张量的维度保持一致,对应元素直接做相应的操作
    API:
    t1 * t2
    t1.mul(t2)
矩阵乘法:
    要求:两个张量,第一个张量的列数,等于第二个张量的 行数
    结果:A行B列
    API:
    t1 @ t2
    t1.dot(t2)  #扩展:只针对一维张量有效
"""

import torch


# 1. 定义函数,演示张量:点乘
def demo01():
    # 要求:两个张量的维度保持一致,对应元素直接做相应的操作
    # 1. 定义张量，2行3列
    t1 = torch.tensor([[1, 2, 3], [4, 5, 6]])
    print(f"t1:{t1}")

    # 2. 定义张量，2行3列
    t2 = torch.tensor([[1, 2, 3], [4, 5, 6]])
    print(f"t2:{t2}")

    # 3. 演示 张量 点乘操作
    t3 = t1 * t2
    # t3 = t1.mul(t2)   #效果同上
    # 4. 打印结果
    print(f"t3:{t3}")


# 2. 定义函数,演示张量:矩阵乘法
def demo02():
    # 要求:两个张量,第一个张量的列数,等于第二个张量的 行数
    # 1. 定义张量，2行3列
    t1 = torch.tensor([[1, 2, 3], [4, 5, 6]])
    print(f"t1:{t1}")

    # 2. 定义张量，2行3列
    t2 = torch.tensor([[1, 2], [3, 4], [5, 6]])
    print(f"t2:{t2}")

    # 3. 演示 张量 点乘操作
    t3 = t1 @ t2
    # t3 = t1.matmul(t2)    #效果同上
    # 4. 打印结果
    print(f"t3:{t3}")


if __name__ == "__main__":
    demo01()
    demo02()
